<script setup>
import style from './ourProducts.scss'
import gStyle from '../../../assets/global_var/global_var.scss'
</script>

<template>
    <div class="ourProducts">
        <div class="container">
            <div class="ourProducts__title">
                <div class="title-left">
                    <p>Представляем Вам лучшие проекты, сделанные нашей командой профессионалов 
                    с любовью и заботой о клиентах. Портфолио позволит Вам увидеть стиль, 
                    модели, качество, дизайн нашей мебели.</p>
                </div>
                <div class="title-right">
                    <h4>\\Лучшие работы</h4>
                    <h3>Создаём уютную атмосферу вашего дома</h3>
                </div>
            </div>
            <div class="ourProducts__item">
                <div class="elem elem-1">
                    <img src="../../../assets/img/card-img1.png" alt="#">
                    <a class="elem__location" href="">
                        <svg xmlns="http://www.w3.org/2000/svg" width="20" height="30" viewBox="0 0 20 30" fill="none">
                        <g clip-path="url(#clip0_411_5)">
                        <path d="M10.0602 4.02323C8.43211 4.02531 6.87123 4.76851 5.72001 6.08977C4.56879 7.41103 3.92123 9.20244 3.91942 11.071C3.91942 11.3996 4.05656 13.2845 6.77379 18.0302C7.83514 19.8587 8.96008 21.6375 10.1459 23.3622C10.8659 22.2939 11.6717 21.0464 12.462 19.7223C16.0964 13.6386 16.1992 11.315 16.1992 11.071C16.1974 9.20312 15.5503 7.4123 14.3999 6.09116C13.2494 4.77001 11.6894 4.02635 10.0619 4.02323H10.0602ZM10.0602 0.0881348C15.3455 0.0881348 19.6296 5.007 19.6296 11.071C19.6296 17.0681 10.2213 29.6013 10.0619 29.6013L10.0602 29.5974C10.1116 29.3121 0.490738 17.1369 0.490738 11.071C0.490738 5.00503 4.77659 0.0881348 10.0602 0.0881348Z" fill="#F5DE09"/>
                        </g>
                        <defs>
                        <clipPath id="clip0_411_5">
                        <rect width="19.1389" height="29.5132" fill="white" transform="translate(0.490738 0.0881348)"/>
                        </clipPath>
                        </defs>
                        </svg>
                        Украина, город Одесса
                    </a>
                    <p class="elem__info">Cовременная спальня в нежных нейтральных тонах</p>
                </div>
                <div class="elem elem-2">
                    <img src="../../../assets/img/card-img2.png" alt="#">
                    <a class="elem__location" href="">
                        <svg xmlns="http://www.w3.org/2000/svg" width="20" height="30" viewBox="0 0 20 30" fill="none">
                        <g clip-path="url(#clip0_411_5)">
                        <path d="M10.0602 4.02323C8.43211 4.02531 6.87123 4.76851 5.72001 6.08977C4.56879 7.41103 3.92123 9.20244 3.91942 11.071C3.91942 11.3996 4.05656 13.2845 6.77379 18.0302C7.83514 19.8587 8.96008 21.6375 10.1459 23.3622C10.8659 22.2939 11.6717 21.0464 12.462 19.7223C16.0964 13.6386 16.1992 11.315 16.1992 11.071C16.1974 9.20312 15.5503 7.4123 14.3999 6.09116C13.2494 4.77001 11.6894 4.02635 10.0619 4.02323H10.0602ZM10.0602 0.0881348C15.3455 0.0881348 19.6296 5.007 19.6296 11.071C19.6296 17.0681 10.2213 29.6013 10.0619 29.6013L10.0602 29.5974C10.1116 29.3121 0.490738 17.1369 0.490738 11.071C0.490738 5.00503 4.77659 0.0881348 10.0602 0.0881348Z" fill="#F5DE09"/>
                        </g>
                        <defs>
                        <clipPath id="clip0_411_5">
                        <rect width="19.1389" height="29.5132" fill="white" transform="translate(0.490738 0.0881348)"/>
                        </clipPath>
                        </defs>
                        </svg>
                        Украина, город Львов
                    </a>
                    <p class="elem__info">Уютный модерн в светлых тонах</p>
                </div>
                <div class="elem elem-3">
                    <img src="../../../assets/img/card-img3.png" alt="#">
                    <a class="elem__location" href="">
                        <svg xmlns="http://www.w3.org/2000/svg" width="20" height="30" viewBox="0 0 20 30" fill="none">
                        <g clip-path="url(#clip0_411_5)">
                        <path d="M10.0602 4.02323C8.43211 4.02531 6.87123 4.76851 5.72001 6.08977C4.56879 7.41103 3.92123 9.20244 3.91942 11.071C3.91942 11.3996 4.05656 13.2845 6.77379 18.0302C7.83514 19.8587 8.96008 21.6375 10.1459 23.3622C10.8659 22.2939 11.6717 21.0464 12.462 19.7223C16.0964 13.6386 16.1992 11.315 16.1992 11.071C16.1974 9.20312 15.5503 7.4123 14.3999 6.09116C13.2494 4.77001 11.6894 4.02635 10.0619 4.02323H10.0602ZM10.0602 0.0881348C15.3455 0.0881348 19.6296 5.007 19.6296 11.071C19.6296 17.0681 10.2213 29.6013 10.0619 29.6013L10.0602 29.5974C10.1116 29.3121 0.490738 17.1369 0.490738 11.071C0.490738 5.00503 4.77659 0.0881348 10.0602 0.0881348Z" fill="#F5DE09"/>
                        </g>
                        <defs>
                        <clipPath id="clip0_411_5">
                        <rect width="19.1389" height="29.5132" fill="white" transform="translate(0.490738 0.0881348)"/>
                        </clipPath>
                        </defs>
                        </svg>
                        Украина, город Киев
                    </a>
                    <p class="elem__info">Компактная двухспальная кровать в стиле модерн</p>    
                </div>
            </div>
            <button class="ourProducts__btn">Перейти в каталог</button>
        </div>
    </div>
</template>