<script setup>
import style from './footer.scss'
import globalStyle from '../../../assets/global_var/global_var.scss'
</script>

<template>
    <div class="footer">
        <div class="container">
            <div class="footer__items">
                <div class="footer__info">
                    <img class="footer__logo" src="../../../assets/img/Logo-fff.svg" alt="#">
                    <h2>Коротко о нас</h2>
                    <p>ZIDesign -  это забота о Вас. Мы досконально прорабатываем все пожелания наших клиентов и воплощаем их в реальность. 
                       Наша мебель никого не оставить равнодушным. Будь-то кровать, шкаф или стол - каждое изделие изготовлено с любовью и заботой.
                    </p>
                </div>
                <div class="footer__links">
                    <div class="links__menu">
                        <h2>меню</h2>
                        <a href="">Главная</a>
                        <a href="">Каталог</a>
                        <a href="">Проекты</a>
                        <a href="">Услуги</a>
                        <a href="">О компании</a>
                    </div>
                    <div class="links__serv">
                        <h2>услуги</h2>
                        <a href="">Снятие замеров</a>
                        <a href="">Проектирование</a>
                        <a href="">Доставка</a>
                        <a href="">Сборка</a>
                    </div>
                </div>
                <div class="footer__contacts">
                    <h2>Мы в соц. Сетях</h2>
                    <p>Подпишитесь на нас в социальных сетях, что бы не пропустить новые коллекции.</p>
                    <div class="contacts__social">
                        <a href="">
                            <svg width="44" height="45" viewBox="0 0 16 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <g clip-path="url(#clip0_11_126)">
                            <path d="M8.00356 5.88965C5.73214 5.88965 3.89999 7.72322 3.89999 9.99643C3.89999 12.2696 5.73214 14.1032 8.00356 14.1032C10.275 14.1032 12.1071 12.2696 12.1071 9.99643C12.1071 7.72322 10.275 5.88965 8.00356 5.88965ZM8.00356 12.6664C6.53571 12.6664 5.33571 11.469 5.33571 9.99643C5.33571 8.52385 6.53214 7.32648 8.00356 7.32648C9.47499 7.32648 10.6714 8.52385 10.6714 9.99643C10.6714 11.469 9.47142 12.6664 8.00356 12.6664ZM13.2321 5.72166C13.2321 6.25422 12.8036 6.67955 12.275 6.67955C11.7429 6.67955 11.3179 6.25064 11.3179 5.72166C11.3179 5.19268 11.7464 4.76377 12.275 4.76377C12.8036 4.76377 13.2321 5.19268 13.2321 5.72166ZM15.95 6.69385C15.8893 5.4107 15.5964 4.2741 14.6571 3.33766C13.7214 2.40121 12.5857 2.10813 11.3036 2.04379C9.98214 1.96873 6.02142 1.96873 4.69999 2.04379C3.42142 2.10455 2.28571 2.39764 1.34642 3.33408C0.407136 4.27053 0.11785 5.40713 0.0535644 6.69027C-0.0214355 8.01273 -0.0214355 11.9765 0.0535644 13.299C0.114279 14.5821 0.407136 15.7188 1.34642 16.6552C2.28571 17.5916 3.41785 17.8847 4.69999 17.9491C6.02142 18.0241 9.98214 18.0241 11.3036 17.9491C12.5857 17.8883 13.7214 17.5952 14.6571 16.6552C15.5928 15.7188 15.8857 14.5821 15.95 13.299C16.025 11.9765 16.025 8.01631 15.95 6.69385ZM14.2428 14.718C13.9643 15.4185 13.425 15.9582 12.7214 16.2406C11.6679 16.6588 9.16785 16.5623 8.00356 16.5623C6.83928 16.5623 4.33571 16.6552 3.28571 16.2406C2.58571 15.9618 2.04642 15.4221 1.76428 14.718C1.34642 13.6636 1.44285 11.1616 1.44285 9.99643C1.44285 8.83123 1.34999 6.3257 1.76428 5.27488C2.04285 4.57434 2.58214 4.03463 3.28571 3.75227C4.33928 3.33408 6.83928 3.43059 8.00356 3.43059C9.16785 3.43059 11.6714 3.33766 12.7214 3.75227C13.4214 4.03105 13.9607 4.57076 14.2428 5.27488C14.6607 6.32928 14.5643 8.83123 14.5643 9.99643C14.5643 11.1616 14.6607 13.6671 14.2428 14.718Z" fill="#fff" fill-opacity="0.75"/>
                            </g>
                            <defs>
                            <clipPath id="clip0_11_126">
                            <rect width="16" height="18.3" fill="white" transform="translate(0 0.849998)"/>
                            </clipPath>
                            </defs>
                            </svg>
                        </a>
                        <a href="">
                            <svg width="44" height="45" viewBox="0 0 16 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M16 10.0487C16 5.60243 12.4194 2 8 2C3.58065 2 0 5.60243 0 10.0487C0 14.0659 2.92548 17.3957 6.75 18V12.3753H4.71774V10.0487H6.75V8.27537C6.75 6.25834 7.94355 5.14418 9.77161 5.14418C10.6471 5.14418 11.5626 5.30126 11.5626 5.30126V7.28097H10.5535C9.56 7.28097 9.25 7.9015 9.25 8.53793V10.0487H11.4687L11.1139 12.3753H9.25V18C13.0745 17.3957 16 14.0659 16 10.0487Z" fill="#fff" fill-opacity="0.75"/>
                            </svg>
                        </a>
                    </div>
                </div>
            </div>
        </div>
    </div>
</template>

<style scoped>

</style>